socialNetwork/jaeger_traces/limit_socnetapp_media-service/traces_0.2.log
Running 30s test @ http://ms1311.utah.cloudlab.us:8080/wrk2-api/post/compose
  8 threads and 1000 connections

  Thread calibration: mean lat.: 12.180ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 12.666ms, rate sampling interval: 37ms
  Thread calibration: mean lat.: 13.323ms, rate sampling interval: 40ms
  Thread calibration: mean lat.: 12.942ms, rate sampling interval: 37ms
  Thread calibration: mean lat.: 13.657ms, rate sampling interval: 39ms
  Thread calibration: mean lat.: 14.453ms, rate sampling interval: 38ms
  Thread calibration: mean lat.: 13.674ms, rate sampling interval: 40ms
  Thread calibration: mean lat.: 14.098ms, rate sampling interval: 39ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://ms1311.utah.cloudlab.us:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    15.58ms    7.33ms  42.43ms   85.55%
    Req/Sec    24.58     26.07   102.00     82.52%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.11ms
 75.000%   18.11ms
 90.000%   22.80ms
 99.000%   42.43ms
 99.900%   84.35ms
 99.990%  106.69ms
 99.999%  106.69ms
100.000%  106.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       5.399     0.000000            1         1.00
       9.215     0.100000          391         1.11
      10.519     0.200000          782         1.25
      11.479     0.300000         1171         1.43
      12.719     0.400000         1561         1.67
      14.111     0.500000         1950         2.00
      14.807     0.550000         2145         2.22
      15.543     0.600000         2340         2.50
      16.287     0.650000         2535         2.86
      17.231     0.700000         2730         3.33
      18.111     0.750000         2926         4.00
      18.671     0.775000         3023         4.44
      19.215     0.800000         3120         5.00
      19.823     0.825000         3216         5.71
      20.767     0.850000         3313         6.67
      21.695     0.875000         3411         8.00
      22.207     0.887500         3461         8.89
      22.815     0.900000         3509        10.00
      23.519     0.912500         3557        11.43
      24.591     0.925000         3605        13.33
      25.663     0.937500         3656        16.00
      26.479     0.943750         3678        17.78
      27.231     0.950000         3703        20.00
      28.351     0.956250         3727        22.86
      30.095     0.962500         3752        26.67
      31.471     0.968750         3776        32.00
      32.319     0.971875         3788        35.56
      33.311     0.975000         3800        40.00
      34.079     0.978125         3812        45.71
      35.679     0.981250         3824        53.33
      37.215     0.984375         3837        64.00
      38.111     0.985938         3843        71.11
      40.287     0.987500         3849        80.00
      42.015     0.989062         3856        91.43
      43.551     0.990625         3861       106.67
      44.415     0.992188         3867       128.00
      45.919     0.992969         3870       142.22
      47.583     0.993750         3873       160.00
      49.407     0.994531         3876       182.86
      52.639     0.995313         3879       213.33
      55.007     0.996094         3882       256.00
      58.431     0.996484         3884       284.44
      61.631     0.996875         3885       320.00
      63.647     0.997266         3887       365.71
      65.471     0.997656         3888       426.67
      70.015     0.998047         3890       512.00
      76.863     0.998242         3891       568.89
      76.863     0.998437         3891       640.00
      78.271     0.998633         3892       731.43
      84.351     0.998828         3893       853.33
      90.495     0.999023         3894      1024.00
      90.495     0.999121         3894      1137.78
      90.495     0.999219         3894      1280.00
      93.183     0.999316         3895      1462.86
      93.183     0.999414         3895      1706.67
      95.807     0.999512         3896      2048.00
      95.807     0.999561         3896      2275.56
      95.807     0.999609         3896      2560.00
      95.807     0.999658         3896      2925.71
      95.807     0.999707         3896      3413.33
     106.687     0.999756         3897      4096.00
     106.687     1.000000         3897          inf
#[Mean    =       15.577, StdDeviation   =        7.332]
#[Max     =      106.624, Total count    =         3897]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5817 requests in 30.13s, 1.19MB read
  Socket errors: connect 0, read 0, write 0, timeout 9597
Requests/sec:    193.08  
Transfer/sec:     40.54KB