socialNetwork/jaeger_traces/limit_socnetapp_media-service/traces_0.4.log
Running 30s test @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose
  8 threads and 1000 connections

  Thread calibration: mean lat.: 5.280ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.466ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.828ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.623ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.556ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.738ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.679ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.793ms, rate sampling interval: 11ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.53ms  667.06us   6.46ms   72.14%
    Req/Sec    25.63     49.74   200.00     76.41%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.43ms
 75.000%    4.90ms
 90.000%    5.39ms
 99.000%    6.46ms
 99.900%    8.87ms
 99.990%   11.27ms
 99.999%   11.27ms
100.000%   11.27ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.173     0.000000            1         1.00
       3.793     0.100000          401         1.11
       3.967     0.200000          781         1.25
       4.123     0.300000         1178         1.43
       4.271     0.400000         1567         1.67
       4.431     0.500000         1955         2.00
       4.503     0.550000         2147         2.22
       4.591     0.600000         2345         2.50
       4.691     0.650000         2537         2.86
       4.791     0.700000         2737         3.33
       4.899     0.750000         2931         4.00
       4.963     0.775000         3031         4.44
       5.031     0.800000         3125         5.00
       5.103     0.825000         3223         5.71
       5.195     0.850000         3324         6.67
       5.283     0.875000         3417         8.00
       5.335     0.887500         3465         8.89
       5.391     0.900000         3514        10.00
       5.447     0.912500         3562        11.43
       5.523     0.925000         3611        13.33
       5.587     0.937500         3659        16.00
       5.635     0.943750         3683        17.78
       5.691     0.950000         3709        20.00
       5.759     0.956250         3733        22.86
       5.863     0.962500         3756        26.67
       5.943     0.968750         3782        32.00
       6.003     0.971875         3793        35.56
       6.067     0.975000         3805        40.00
       6.115     0.978125         3818        45.71
       6.191     0.981250         3829        53.33
       6.251     0.984375         3842        64.00
       6.279     0.985938         3848        71.11
       6.319     0.987500         3855        80.00
       6.383     0.989062         3860        91.43
       6.503     0.990625         3866       106.67
       6.559     0.992188         3872       128.00
       6.631     0.992969         3875       142.22
       6.703     0.993750         3878       160.00
       6.819     0.994531         3881       182.86
       6.859     0.995313         3884       213.33
       7.035     0.996094         3887       256.00
       7.095     0.996484         3889       284.44
       7.107     0.996875         3890       320.00
       7.163     0.997266         3892       365.71
       7.231     0.997656         3893       426.67
       7.255     0.998047         3895       512.00
       7.583     0.998242         3896       568.89
       7.583     0.998437         3896       640.00
       7.771     0.998633         3897       731.43
       8.871     0.998828         3898       853.33
       9.167     0.999023         3899      1024.00
       9.167     0.999121         3899      1137.78
       9.167     0.999219         3899      1280.00
       9.927     0.999316         3900      1462.86
       9.927     0.999414         3900      1706.67
      10.007     0.999512         3901      2048.00
      10.007     0.999561         3901      2275.56
      10.007     0.999609         3901      2560.00
      10.007     0.999658         3901      2925.71
      10.007     0.999707         3901      3413.33
      11.271     0.999756         3902      4096.00
      11.271     1.000000         3902          inf
#[Mean    =        4.529, StdDeviation   =        0.667]
#[Max     =       11.264, Total count    =         3902]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5854 requests in 30.04s, 1.20MB read
  Socket errors: connect 0, read 0, write 0, timeout 9496
Requests/sec:    194.84  
Transfer/sec:     40.91KB